name: "paddy_resnet34"
platform: "onnxruntime_onnx"
default_model_filename: "paddy_resnet34.onnx"
max_batch_size: 0

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ 1, 10 ]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]
